EWSEditor/EwsPostExamples/GetOofSettings - Impersonation.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
      <t:RequestServerVersion Version="Exchange2016" />
      <t:ExchangeImpersonation>
        <t:ConnectingSID>
          <t:SmtpAddress>user1@contoso.com</t:SmtpAddress>
        </t:ConnectingSID>
      </t:ExchangeImpersonation>
    </soap:Header>
    <soap:Body>
    <m:GetUserOofSettingsRequest>
      <t:Mailbox>
        <t:Address>user1@contoso.com</t:Address>
      </t:Mailbox>
    </m:GetUserOofSettingsRequest>
  </soap:Body>
</soap:Envelope>